In [0]:
# Author : Karthikeyan V
# Stack Overflow Case Study
# import the Python Libraries
import pandas as pd
import numpy as py
import matplotlib.pyplot as plt

**Data Collection**

Get the data from public S3 Storage to perform EDA

In [0]:
# read the Questions Dataset stored in AWS S3 public storage 
inpQues = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Questions.csv", encoding="ISO-8859-1")

In [0]:
# read the Question Tags Dataset stored in AWS S3 public storage
inpQuesTags = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Tags.csv", encoding="ISO-8859-1")

In [0]:
# read the Answers Dataset stored in AWS S3 public storage 
inpAns = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Answers.csv", encoding="ISO-8859-1")

In [0]:
# read the Users Dataset stored in AWS S3 public storage 
inpUsers = pd.read_csv("https://stack-overflow-casestudy-datasets.s3.amazonaws.com/Users.csv", encoding="ISO-8859-1")

**EDA on Question Data Set**

*   Look at the data set to perform EDA
*   The CreationDate and ClosedDate columns are not dates. Convert them into 
Dates

In [36]:
inpQues.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1264216 entries, 0 to 1264215
Data columns (total 7 columns):
Id              1264216 non-null int64
OwnerUserId     1249762 non-null float64
CreationDate    1264216 non-null datetime64[ns, UTC]
ClosedDate      55959 non-null datetime64[ns, UTC]
Score           1264216 non-null int64
Title           1264216 non-null object
Body            1264216 non-null object
dtypes: datetime64[ns, UTC](2), float64(1), int64(2), object(2)
memory usage: 67.5+ MB

In [9]:
inpQues.head(5)

    Id  ...                                               Body
0   80  ...  <p>I've written a database generation script i...
1   90  ...  <p>Are there any really good tutorials explain...
2  120  ...  <p>Has anyone got experience creating <strong>...
3  180  ...  <p>This is something I've pseudo-solved many t...
4  260  ...  <p>I have a little game written in C#. It uses...

[5 rows x 7 columns]

In [11]:
inpQues.describe()

                 Id   OwnerUserId         Score
count  1.264216e+06  1.249762e+06  1.264216e+06
mean   2.132745e+07  2.155177e+06  1.781537e+00
std    1.151445e+07  1.801265e+06  1.366389e+01
min    8.000000e+01  1.000000e+00 -7.300000e+01
25%    1.142598e+07  6.589110e+05  0.000000e+00
50%    2.172542e+07  1.611830e+06  0.000000e+00
75%    3.154542e+07  3.353792e+06  1.000000e+00
max    4.014338e+07  7.046594e+06  5.190000e+03

In [31]:
# Question Data Set - Null Checks
inpQues.isnull().sum()

Id                    0
OwnerUserId       14454
CreationDate          0
ClosedDate      1208257
Score                 0
Title                 0
Body                  0
dtype: int64

In [15]:
# Display the Question records whose  OwnerUserId is null
inpQues[inpQues["OwnerUserId"].isnull()]

               Id  ...                                               Body
47           4170  ...  <p>I need to learn ADO.NET to build applicatio...
130         12330  ...  <p>Hey everyone, \nIs there any known way of l...
158         15190  ...  <p>I have a project group that contains a proj...
198         18250  ...  <p>The creation date of an executable linked i...
300         29100  ...  <p>I came across a printed <a href="http://www...
...           ...  ...                                                ...
1261359  40076260  ...  <p>My function takes two objects that represen...
1261501  40079260  ...  <p><a href="http://i.stack.imgur.com/M2EV8.png...
1263664  40130890  ...  <p><div class="snippet" data-lang="js" data-hi...
1263908  40136590  ...  <p>In <strong>my_data</strong> I want to creat...
1264010  40138620  ...  <p>I have iMac and my bash on terminal has .ba...

[14454 rows x 7 columns]

In [0]:
# Convert the CreationDate into DateTime Object so that we can perform data analysis based on date/time values
inpQues['CreationDate']=pd.to_datetime(inpQues['CreationDate'])

In [0]:
# Convert the ClosedDate into DateTime Object so that we can perform data analysis based on date/time values
inpQues['ClosedDate']=pd.to_datetime(inpQues['ClosedDate'])

In [0]:
# Create a new column to identify which are the unanswered or open questions from the dataset
inputQues[]

In [16]:
inpQuesTags["Tag"].value_counts()

javascript            124155
java                  115212
c#                    101186
php                    98808
android                90659
                       ...
fcbkcomplete               1
sxml                       1
filecompare                1
structured-storage         1
directed-identity          1
Name: Tag, Length: 37034, dtype: int64

In [0]:
inpQuesTags.sort_values("Tag", axis = 0, ascending = True, inplace = True, na_position ='last')

In [18]:
inpQuesTags.head(5)

               Id Tag
152175    2488400  .a
454703    6211950  .a
2218583  25550490  .a
459374    6267900  .a
2091204  24225810  .a

In [0]:
inpQuesTagsDataScience = inpQuesTags[(inpQuesTags.values  == "r")|(inpQuesTags.values  == "matlab")|(inpQuesTags.values  == "excel")|(inpQuesTags.values  == "sql")|(inpQuesTags.values  == "sas")|(inpQuesTags.values  == "python")]

In [20]:
inpQuesTagsDataScience.Tag.value_counts()

python    64601
sql       35782
r         15701
excel     10384
matlab     6495
sas         697
Name: Tag, dtype: int64

In [21]:
inpQuesTagsDataScience.count

<bound method DataFrame.count of                Id    Tag
2597066  29468070  excel
2287942  26277120  excel
3089864  34278230  excel
1682212  19870840  excel
3747799  40117180  excel
...           ...    ...
749660    9576740    sql
1488252  17746260    sql
747018    9548120    sql
3725911  39946070    sql
4062       121700    sql

[133660 rows x 2 columns]>

In [22]:
inpQuesTagsDataScience.head(15)

               Id    Tag
2597066  29468070  excel
2287942  26277120  excel
3089864  34278230  excel
1682212  19870840  excel
3747799  40117180  excel
3747788  40117080  excel
1537848  18296520  excel
431517    5943620  excel
2183780  25187020  excel
204710    3168050  excel
3750573  40140120  excel
3205940  35341310  excel
540549    7200000  excel
3090013  34279690  excel
3222655  35494530  excel

In [23]:
inpQuesTagsDataScience[inpQuesTagsDataScience.Tag.isnull()]

Empty DataFrame
Columns: [Id, Tag]
Index: []

In [24]:
inpQuesTagsDataScience.tail(15)

               Id  Tag
1773370  20873130  sql
2240776  25782310  sql
1791857  21072970  sql
1724111  20328570  sql
2778863  31300310  sql
377369    5302540  sql
1605638  19036470  sql
776973    9885470  sql
7621       206490  sql
2475794  28234500  sql
749660    9576740  sql
1488252  17746260  sql
747018    9548120  sql
3725911  39946070  sql
4062       121700  sql

In [25]:
inpQuesTagsDataScience.Id.value_counts()

9807450     3
36043670    3
26115210    3
20151800    3
12679530    3
           ..
33998860    1
35091640    1
38938640    1
22700090    1
39321600    1
Name: Id, Length: 132075, dtype: int64

In [26]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 35918200]

               Id     Tag
3269827  35918200  matlab
3269825  35918200  python
3269826  35918200       r

In [27]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 29325500]

               Id     Tag
2582988  29325500   excel
2582989  29325500  matlab
2582987  29325500       r

In [28]:
inpQuesTagsDataScience.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 133660 entries, 2597066 to 4062
Data columns (total 2 columns):
Id     133660 non-null int64
Tag    133660 non-null object
dtypes: int64(1), object(1)
memory usage: 3.1+ MB

In [29]:
inpQuesTagsDataScience.loc[inpQuesTagsDataScience['Id'] == 26115210]

               Id     Tag
2272532  26115210   excel
2272533  26115210  matlab
2272531  26115210     sql

In [30]:
inpQuesTagsDataScience.Tag.value_counts()

python    64601
sql       35782
r         15701
excel     10384
matlab     6495
sas         697
Name: Tag, dtype: int64